// Придумати одне завдання з даної теми і повністю його розібрати. Завдання повино бути цікавим і повчальним, в ньому повинен розглядатися якийсь нюанс роботи з мовою С. (1 бал)
#include <stdio.h>
#include <string.h>

int main() {
    system("chcp 65001");
    char line[100];
    int length;

    printf("Введіть рядок: ");

    if (fgets(line, sizeof(line), stdin) == NULL) {
        printf("Помилка зчитування рядка.\n");
        return 1;
    }

    length = strlen(line);
    if (length > 0 && line[length - 1] == '\n') {
        line[length - 1] = '\0';
        length--;
    }

    printf("Рядок у зворотному порядку: ");

    for (int i = length - 1; i >= 0; i--) {
        printf("%c", line[i]);
    }
    printf("\n");
    return 0; 
}

// Це завдання призначене для глибшого розуміння принципів роботи рядків та їхнього введення/виведення.
// Зокрема, це завдання звертає увагу на такі нюанси, як: 
// - нульовий термінатор, який рахується за окремий елемент масиву символів;
// - постійні перевірки введеного тексту;
// - базовий спосіб виводу символів