// А: "60.00" - правильна відповідь, адже компілятор не зарахує дробову частину, що знаходиться після коми. 
// Тому програма буде шукати значення для виразу: 5 * 12
// B: 0.00 - цей варіант відповіді можуть обрати люди, які знають про момент з "крапкою", але можуть подумати,
// що компілятор зарахує значення для дробового числа як 0.00
// C: повідомлення про помилку - цей варіант відповіді також можуть обрати люди, які знають про момент з "крапкою",
// але можуть подумати, що компілятор повідомить про неправильне введення та зупинить виконання програми
// D: 62.5 - цей варіант найлогічніший, адже це правильна відповідь, якщо просто помножити 5 та 12.5, проте він неправильний у контексті цього тесту, тому що для його отримання дробове число потрібно писати через крапку