// Придумати одне завдання з даної теми і повністю його розібрати. Завдання 
// повино бути цікавим і повчальним, в ньому повинен розглядатися якийсь 
// нюанс роботи з мовою С. (1 бал)

// Завдання: Користувач вводить із клавіатури 17 мільйонів та 8 мільнів, виведіть їх добуток.

// (Приклад реалізацій)
#include <stdio.h>
#include <stdlib.h>

int main() 
{
    system("chcp 65001");
    long long a, b;
    printf("\nВведіть через пробіл значення\n");
    scanf("%lld", &a);
    scanf("%lld", &b);
    printf("\nРезультат: %lld\n",a, b, a*b);
    return 0;
}
// Завдання хоч і просте, але корисне. Переглянувши завдання та тести, я помітив,
// що мало де згадується типи даних long та long long. А, як відомо, в математичних
// обчисленнях доведеться часто стикатись із великими числами. Тому це завдання допоможе згади
// або отимати навички із використання великих типів даних. Звісно, можна було реалізувати це по іншому,
// не використовуючи ці ресурсозатратні типи даних, але за умов необмеженої оперативної пам'яті, 
// це завдання легко вирішується із використанням long long.