// Придумати тест на дану тему з одним питанням і чотирма варіантами відповідей 
// та розписати чому саме такі варіанти. Тест повинен бути цікавим і повчальним, 
// там повинен розглядатися якийсь нюанс роботи з мовою С.

// Який результат компіляції буде виведено в консолі?
#include <stdio.h>
#include <stdlib.h>

int main() 
{
    system("chcp 65001");
    char a = '2';
    char b = '3';
    printf("\nРезультат: %c\n", a+b);
    return 0;
}
// А: "e" - правильний варіант, адже компілятору потрібно вивести один символ, тому він додав ASCII занчення двійки та трійки
// 50 + 51 = 101, а в таблиці ASCII під цим значенням символ "e"
// B: "23" - цей варіант обере людина, яка помітила, що змінні типу char, а в printf відбувається додавання символів
// C: "5" - цей варіант обере людина, яка бігло розібрала цей код, і не звернула увагу на типи змінних чи тип у printf
// D: "помилка компіляції" - цей варіант обере людина, яка помітила усі нюанси цього завдання, але не знає, що виведеться в результаті