// Придумати тест на дану тему з одним питанням і чотирма варіантами відповідей та розписати чому саме такі варіанти. Тест повинен бути цікавим і повчальним, там повинен розглядатися якийсь нюанс роботи з мовою С. (1 бал).

// Який результат компіляції?
#include <stdio.h>

int main() {
    system("chcp 65001");

    const int x = 5;
    char y = 'A';
    int z;

    if ( (x = x + 1 && y != 'B' || (z = x * 2) > 10) && ( (y = y + 1) == 'B' ? x < 10 : z % 3 == 0 ) ) {
        printf("%d %c %d\n", x, y, z);
    } else {
        printf("%d %c %d\n", y, x, z);
    }

    printf("%d\n", ++x + (y == 'C' ? x : z));

    return 0;
}

// А: "A 5 6" - цей варіант може обрати людина, яка подумає, що правильна відповідь виводитиметься через else 
// B: "0 0 0" - цей варіант відповіді можуть обрати люди, які знають про const, але не знають,
// чи зупинить компілятор роботу на помилці
// C: "повідомлення про помилку" - цей варіант правильний, адже людина, яка помітила const, відразу зрозуміє, що у коді багато помилок з присвоєнняи
// D: "6 B 12" - цей варіант міг бути правильним, якби не оголошення const.
