// Придумати одне завдання з даної теми і повністю його розібрати. Завдання повино бути цікавим і повчальним, в ньому повинен розглядатися якийсь нюанс роботи з мовою С. (1 бал)
#include <stdio.h>

int main() {
    system("chcp 65001");
    int n;
    float x, sum=0;

    printf("Введіть кількість елементів для підрахунку середнього арифметичного: ");
    scanf("%d", &n);

    for (int i=0; i<n; i++){
        printf("\nВведіть число: ");
        scanf("%f", &x);
        sum += x;
    }
    printf("Середнє арифметичне %d чисел: %.2f\n", n, sum/n);
    return 0;
}