// Користувач вводить координати двох точок. Обчисліть відстань між ними (формула Евклідової відстані).(0.2 бала)
#include <stdio.h>
#include <math.h>

int main() {
    system("chcp 65001");
    float x1, y1, x2, y2;
    
    printf("Введіть координати першої точки (x1 y1): ");
    scanf("%f %f", &x1, &y1);
    
    printf("Введіть координати другої точки (x2 y2): ");
    scanf("%f %f", &x2, &y2);

    printf("Відстань між точками: %.2f\n", sqrt(pow(x2 - x1, 2) + pow(y2 - y1, 2)));
    
    return 0;
}